// 問題
export const questions = [
  { "question": "聞くよりも話すほうが好きだ", "select-type": 2, "pos": "X" },
  { "question": "自分はせっかちなほうだ", "select-type": 2, "pos": "X" },
  { "question": "人をまとめるのが得意だ", "select-type": 2, "pos": "X" },
  { "question": "相手の目を見て話すほうだ", "select-type": 2, "pos": "X" },
  { "question": "人を動かすことができる", "select-type": 2, "pos": "X" },
  { "question": "思ったことがすぐ口から出てしまうほうだ", "select-type": 2, "pos": "X" },
  { "question": "組体操より、かけっこが好きだ", "select-type": 2, "pos": "X" },
  { "question": "他人と話すのが好きだ", "select-type": 2, "pos": "X" },
  { "question": "話し合いでは、みんなの意見を尊重するより自分の意見を主張するほうだ", "select-type": 2, "pos": "X" },
  { "question": "自分は感情豊かだ", "select-type": 2, "pos": "Y" },
  { "question": "「元気だね」とよく言われる", "select-type": 2, "pos": "Y" },
  { "question": "仕事よりプライベートを大切にしたい", "select-type": 2, "pos": "Y" },
  { "question": "自分はクールだと言われない", "select-type": 2, "pos": "Y" },
  { "question": "自分の気持ちを表すのが得意だ", "select-type": 2, "pos": "Y" },
  { "question": "自分は陽気な方だと思う", "select-type": 2, "pos": "Y" },
  { "question": "データより人の意見を信じるほうだ", "select-type": 2, "pos": "Y" },
  { "question": "自分は感情豊かで涙もろいほうだと思う。", "select-type": 2, "pos": "Y" },
  { "question": "会話では、抑揚をつけて話すほうだ", "select-type": 2, "pos": "Y" },
];


// 結果(クエリなし);
export const style_result = {
  date: "2022/09/25",
  X: 70,
  Y: 60,
  feature: [
    "感情は出さないがメリハリがあり強い話し方をする",
    "しっかり目を合わせて話す",
    "短めの文章で、結論からハッキリと断定的に話す"
  ],
  Profession: ["営業", "弁護士", "コンサルタント"],
  Relational_description: [
    "エミアブルタイプは○○○○で△△△な性格を持ち合わせた方が多いです。といった形で対象のタイプの簡単な説明を入れます。XXXXXタイプとのかかわり方として、とてもOOOOでYYYYだとおもいますが、△△△の場面において考え方に違いが生まれる可能性が高いので注意が必要です。といったようなをこ、 関わることによるメリットと関わる際の注意点をここに記述します。(いいところ・注意すべき点といったように分けてもいいかも)",

    "ドライバータイプは○○○○で△△△な性格を持ち合わせた方が多いです。といった形で対象のタイプの簡単な説明を入れます。XXXXXタイプとのかかわり方として、とてもOOOOでYYYYだとおもいますが、△△△の場面において考え方に違いが生まれる可能性が高いので注意が必要です。といったようなをこ、 関わることによるメリットと関わる際の注意点をここに記述します。(いいところ・注意すべき点といったように分けてもいいかも)",

    "アナリティカルタイプは○○○○で△△△な性格を持ち合わせた方が多いです。といった形で対象のタイプの簡単な説明を入れます。XXXXXタイプとのかかわり方として、とてもOOOOでYYYYだとおもいますが、△△△の場面において考え方に違いが生まれる可能性が高いので注意が必要です。といったようなをこ、 関わることによるメリットと関わる際の注意点をここに記述します。(いいところ・注意すべき点といったように分けてもいいかも)",

    "エクスプレッシブタイプは○○○○で△△△な性格を持ち合わせた方が多いです。といった形で対象のタイプの簡単な説明を入れます。XXXXXタイプとのかかわり方として、とてもOOOOでYYYYだとおもいますが、△△△の場面において考え方に違いが生まれる可能性が高いので注意が必要です。といったようなをこ、 関わることによるメリットと関わる際の注意点をここに記述します。(いいところ・注意すべき点といったように分けてもいいかも)"
  ],
  previous: ["2022/09/10", "2022/09/19", "2022/09/20"]
}

export const style_result_2 = {
  date: "2022/09/20",
  X: 70,
  Y: 30,
  feature: [
    "感情は出さないがメリハリがあり強い話し方をする",
    "しっかり目を合わせて話す",
    "短めの文章で、結論からハッキリと断定的に話す"
  ],
  Profession: ["営業", "弁護士", "コンサルタント"],
  Relational_description: [
    "エミアブルタイプは○○○○で△△△な性格を持ち合わせた方が多いです。といった形で対象のタイプの簡単な説明を入れます。XXXXXタイプとのかかわり方として、とてもOOOOでYYYYだとおもいますが、△△△の場面において考え方に違いが生まれる可能性が高いので注意が必要です。といったようなをこ、 関わることによるメリットと関わる際の注意点をここに記述します。(いいところ・注意すべき点といったように分けてもいいかも)",

    "ドライバータイプは○○○○で△△△な性格を持ち合わせた方が多いです。といった形で対象のタイプの簡単な説明を入れます。XXXXXタイプとのかかわり方として、とてもOOOOでYYYYだとおもいますが、△△△の場面において考え方に違いが生まれる可能性が高いので注意が必要です。といったようなをこ、 関わることによるメリットと関わる際の注意点をここに記述します。(いいところ・注意すべき点といったように分けてもいいかも)",

    "アナリティカルタイプは○○○○で△△△な性格を持ち合わせた方が多いです。といった形で対象のタイプの簡単な説明を入れます。XXXXXタイプとのかかわり方として、とてもOOOOでYYYYだとおもいますが、△△△の場面において考え方に違いが生まれる可能性が高いので注意が必要です。といったようなをこ、 関わることによるメリットと関わる際の注意点をここに記述します。(いいところ・注意すべき点といったように分けてもいいかも)",

    "エクスプレッシブタイプは○○○○で△△△な性格を持ち合わせた方が多いです。といった形で対象のタイプの簡単な説明を入れます。XXXXXタイプとのかかわり方として、とてもOOOOでYYYYだとおもいますが、△△△の場面において考え方に違いが生まれる可能性が高いので注意が必要です。といったようなをこ、 関わることによるメリットと関わる際の注意点をここに記述します。(いいところ・注意すべき点といったように分けてもいいかも)"
  ],
}

